# Проектирование электронной системы для учеников, родителей и преподавателей начальной школы
## Модули и интеграции
В качестве подхода к разработке модели ПО применяем **Domain Driven Design**, так как при проектированиии такой системы крайне важно следование бизнес-логике (система должна быть интуитивно понятной и удобной в использовании). Для реализации сложной SaaS-системы, которая позволит объединять изолированные друг от друга школы, следует также рассмотреть микросервисный подход к проектированию архитектуры.

### Описание модулей
1. Сервис авторизации и аутентификации
  Необходим для регистрации и входа пользователей в приложение. Следует отметить, что сервис должен быть stateful, чтобы пользователям не приходилось каждый раз при входе в приложение заново регистрироваться.
2. 
